[
  {
    "icon":"/images/article-1.jpg",
    "title": "Як працює Event Loop в JavaScript",
    "date": "11 жовтня 2024 року",
    "category": "JavaScript, Асинхронність",
    "description": "Базове розуміння роботи Event Loop допоможе краще керувати асинхронними операціями в JavaScript.",
    "content": "JavaScript працює на основі однопоточного середовища, що означає, що в один момент часу він може виконувати лише одну задачу. Однак за допомогою концепцій, як-от Event Loop, JavaScript може ефективно керувати асинхронними операціями, не блокуючи основний потік. У цьому пості ми розглянемо, як саме працює Event Loop, розберемо поняття call stack, web API, task queue та їхню взаємодію."
  },
  {
    "icon":"/images/article-2.webp",
    "title": "10 Поширених помилок початківців у Python",
    "date": "8 жовтня 2024 року",
    "category": "Python, Помилки",
    "description": "Як уникати найбільш розповсюджених помилок, які допускають новачки у Python.",
    "content": "Python є чудовою мовою для початківців, однак багато новачків роблять типові помилки. У цій статті ми розглянемо десять найбільш розповсюджених проблем: від неправильного використання змінних типів до ігнорування обробки виключень. Крім того, ми надамо кілька корисних порад для оптимізації коду та покращення його читабельності."
  },
  {
    "icon":"/images/article-3.webp",
    "title": "Розуміння принципу SOLID в об'єктно-орієнтованому програмуванні",
    "date": "5 жовтня 2024 року",
    "category": "OOP, Архітектура",
    "description": "Як принципи SOLID допомагають створювати гнучку та зрозумілу архітектуру програмного забезпечення.",
    "content": "Принципи SOLID — це набір рекомендацій, які допомагають розробникам створювати більш структуровані та масштабовані програми в об'єктно-орієнтованому програмуванні. Кожен з цих принципів зосереджений на конкретному аспекті архітектури: від однорідної відповідальності класів до правильної абстракції залежностей. У цьому пості ми розглянемо кожен з цих принципів з прикладами на реальному коді."
  },
  {
    "icon":"/images/article-4.png",
    "title": "Docker для початківців: Як створити свій перший контейнер",
    "date": "3 жовтня 2024 року",
    "category": "DevOps, Docker",
    "description": "Простий вступ у світ Docker: як створити контейнер для вашого веб-додатку.",
    "content": "Docker змінює підхід до розробки та деплою додатків, дозволяючи створювати ізольовані середовища для кожного додатку. У цьому пості ми покажемо, як встановити Docker, створити Dockerfile для вашого Node.js додатку та запустити його в контейнері. Це допоможе вам краще зрозуміти основи контейнеризації та спростить подальшу роботу з різними середовищами."
  },
  {
    "icon":"/images/article-5.avif",
    "title": "Що таке TypeScript і чому він важливий для великих проєктів?",
    "date": "1 жовтня 2024 року",
    "category": "TypeScript, JavaScript",
    "description": "Чому TypeScript став вибором для багатьох команд розробників і як він покращує роботу з JavaScript.",
    "content": "TypeScript — це надбудова над JavaScript, яка додає статичну типізацію та полегшує роботу з великими кодовими базами. Багато команд переходять на TypeScript, оскільки він покращує читабельність коду, зменшує кількість помилок і спрощує інтеграцію в складних проєктах. У цьому пості ми розглянемо основні переваги TypeScript та надамо приклади, де він найкраще підходить для використання."
  }
]
